Repository: bigkoma/jirastopwatch
Catalog: source/StopWatch/Resources/Strings.*.resx
Languages: pl

# Worklog_SubmitTitle
source: Submit Worklogs
pl: Wyślij wpisy czasu

# Worklog_SummaryHeader
source: Worklog Summary
pl: Podsumowanie worklogów

# Worklog_SubmitAll
source: Submit All
pl: Wyślij wszystkie

# Worklog_Submitting
source: Submitting...
pl: Wysyłanie…

# Msg_Success
source: Success
pl: Sukces

# Worklog_SubmitSuccess
source: Successfully submitted worklogs for {0} issues.
pl: Pomyślnie wysłano wpisy dla {0} zadań.

# Worklog_SubmitError
source: Failed to submit worklogs: {0}
pl: Nie udało się wysłać wpisów: {0}

# Menu_File
source: File
pl: Plik

# Menu_Settings
source: Settings
pl: Ustawienia

# Menu_Exit
source: Exit
pl: Zakończ

# Menu_Tools
source: Tools
pl: Narzędzia

# Menu_About
source: About
pl: O programie

# Lbl_Issue
source: Issue:
pl: Zadanie:

# Btn_Pause
source: Pause
pl: Pauza

# Lbl_Total
source: Total:
pl: Suma:

# Btn_AddIssue
source: Add Issue
pl: Dodaj zadanie

# Btn_SubmitWorklog
source: Submit Worklog
pl: Wyślij wpisy

# Btn_Settings
source: Settings
pl: Ustawienia

# Btn_About
source: About
pl: O programie

# SaveTimer_ResetAll
source: Reset all timers on exit
pl: Resetuj wszystkie timery przy wyjściu

# SaveTimer_SavePause
source: Save current timetracking, pause active timer
pl: Zapisz czas, wstrzymaj aktywny timer

# SaveTimer_SaveContinue
source: Save current timetracking, active timer continues
pl: Zapisz czas, aktywny timer kontynuuje

# Pause_None
source: No pause
pl: Bez pauzy

# Pause_Pause
source: Pause active timer
pl: Wstrzymaj aktywny timer

# Pause_PauseResume
source: Pause and resume on unlock
pl: Pauza i wznowienie po odblokowaniu

# PostComment_WorklogOnly
source: Post only as part of worklog
pl: Publikuj tylko w ramach worklogu

# PostComment_CommentOnly
source: Post only as a comment
pl: Publikuj tylko jako komentarz

# PostComment_Both
source: Post as both worklog and comment
pl: Publikuj jako worklog i komentarz

# Btn_Help
source: Help
pl: Pomoc

# Lbl_ActiveFilter
source: Active Filter:
pl: Aktywny filtr:

# Status_NotConnected
source: Jira not configured
pl: Jira nie skonfigurowana

# Status_Connecting
source: Connecting to Jira...
pl: Łączenie z Jira…

# Status_ConnectionError
source: Connection error: {0}
pl: Błąd połączenia: {0}

# Status_ConnectedLoaded
source: Connected - {0} issues loaded
pl: Połączono – załadowano {0} zgłoszeń

# Status_LoadError
source: Error loading issues: {0}
pl: Błąd ładowania zgłoszeń: {0}

# Issue_Comment
source: Comment
pl: Komentarz

# Btn_Log
source: Log
pl: Wyślij

# Btn_Done
source: Done
pl: Zakończone

# Local
source: Localhost
pl: Lokalna lista

source: Running
pl: W trakcie

# Filter_All
source: All Issues
pl: Wszystkie zgłoszenia

# Filter_Mine
source: My Issues
pl: Moje zadania

# Filter_Recent
source: Recent Issues
pl: Ostatnie

source: No filter selected
pl: Nie wybrano filtra

# Msg_Title_NotConfigured
source: Jira not configured
pl: Jira nie skonfigurowana

# Msg_Body_NotConfigured
source: Please configure Jira settings first.
pl: Najpierw skonfiguruj ustawienia Jira.

# Msg_Title_NoWorklogs
source: No worklogs to submit
pl: Brak wpisów do wysłania

# Msg_Body_NoWorklogs
source: No issues have recorded time.
pl: Brak zadań z zarejestrowanym czasem.

# Msg_Title_Error
source: Error
pl: Błąd

# Msg_Body_SubmitFailed
source: Failed to submit worklog. Check your Jira settings and permissions.
pl: Nie udało się wysłać workloga. Sprawdź ustawienia i uprawnienia Jira.

# Tray_Show
source: Show
pl: Pokaż

# Tray_Exit
source: Exit
pl: Zakończ

# Settings_Title
source: Settings
pl: Ustawienia

# JiraSettings_Header
source: Jira Settings
pl: Ustawienia Jira

source: Jira base URL:
pl: Adres bazowy Jira:

# Jira_Username
source: Username:
pl: Nazwa użytkownika:

# Jira_Token
source: API Token:
pl: Token API:

# Jira_GetToken
source: Get a token from Atlassian (opens browser)
pl: Pobierz token z Atlassian (otwiera przeglądarkę)

# AppSettings_Header
source: Application Settings
pl: Ustawienia aplikacji

# App_AlwaysOnTop
source: Always keep window on top
pl: Zawsze na wierzchu

# App_MinimizeToTray
source: Minimize to tray
pl: Minimalizuj do traya

# App_AllowMultiple
source: Allow multiple timers
pl: Zezwalaj na wiele timerów

# App_IncludeProject
source: Include project name in summary
pl: Dołącz nazwę projektu do podsumowania

# App_EnableLogging
source: Enable logging
pl: Włącz logowanie

# App_OpenLogFolder
source: Open log folder
pl: Otwórz folder logów

# Timers_Header
source: Timers & Worklog
pl: Timery i Worklog

source: Save timer on exit:
pl: Zapis timera przy wyjściu:

source: Pause on lock:
pl: Pauza przy zablokowaniu:

source: Post comment:
pl: Publikuj komentarz:

source: Start transitions:
pl: Przejścia startowe:

# CheckForUpdates
source: Check for updates automatically
pl: Automatycznie sprawdzaj aktualizacje

# Btn_Cancel
source: Cancel
pl: Anuluj

# Worklog_Title
source: Post Worklog
pl: Wyślij worklog

# Worklog_AddComment
source: Add a comment (optional)
pl: Dodaj komentarz (opcjonalnie)

# Worklog_TimeSpent
source: Time spent:
pl: Czas pracy:

# Worklog_RemainingHeader
source: Remaining Estimate
pl: Pozostała estymata

# Worklog_AdjustAuto
source: Adjust Automatically
pl: Dostosuj automatycznie

# Worklog_LeaveAsIs
source: Leave as is
pl: Pozostaw bez zmian

# Worklog_SetTo
source: Set to
pl: Ustaw na

# Worklog_ReduceBy
source: Reduce by
pl: Zmniejsz o

# Worklog_StartDate
source: Start date:
pl: Data rozpoczęcia:

# Worklog_StartTime
source: Start time:
pl: Godzina rozpoczęcia:

# Worklog_SaveForLater
source: Save for later
pl: Zapisz na później

# Worklog_Submit
source: Submit
pl: Wyślij

# Worklog_Cancel
source: Cancel
pl: Anuluj

# Help_Title
source: Jira StopWatch by Komasa Help
pl: Pomoc Jira StopWatch by Komasa

# Help_Content
source: 1. Configure Jira settings in Settings 2. Enter issue key and click Start to begin tracking 3. Use Pause/Stop to control the timer 4. Add issues to track multiple items 5. Use filters to load issues from Jira 6. Edit comments and remove issues 7. Submit worklogs to Jira For more help, visit the documentation.
pl: 1. Skonfiguruj ustawienia Jira w Ustawieniach 2. Wprowadź klucz zadania i kliknij Start, aby rozpocząć śledzenie 3. Użyj Pauza/Stop, aby kontrolować timer 4. Dodaj zadania, aby śledzić wiele elementów 5. Użyj filtrów, aby załadować zadania z Jira 6. Edytuj komentarze i usuń zadania 7. Wyślij wpisy czasu do Jira Aby uzyskać więcej pomocy, odwiedź dokumentację.

# About_Title
source: About Jira StopWatch by Komasa
pl: O Jira StopWatch by Komasa

# About_Author
source: Author: Michał Komasa
pl: Autor: Michał Komasa

# About_License
source: Licensed under the Apache License, Version 2.0.
pl: Licencjonowane na podstawie Apache License, Version 2.0.

# About_ReadLicense
source: Read License
pl: Przeczytaj licencję

# About_VisitHomepage
source: Visit product homepage
pl: Odwiedź stronę produktu

# About_Close
source: Close
pl: Zamknij

# EditTime_Title
source: Edit Timer
pl: Edytuj timer

# EditTime_Header
source: Edit timer
pl: Edytuj timer

# EditTime_Help
source: Supported formats: 2h 15m and 2.25h
pl: Obsługiwane formaty: 2h 15m oraz 2.25h

source: Language:
pl: Język:

# Language_Default
source: System default
pl: Domyślny systemu

# Msg_LanguageRestart
source: Change will take effect after restarting the application.
pl: Zmiany zostaną zastowane po ponownym uruchomieniu aplikacji.

# Msg_RestartFailed
source: Failed to restart application. Please restart manually.
pl: Nie udało się ponownie uruchomić aplikacji. Uruchom ponownie ręcznie.

# Msg_NoTransitions
source: No transitions available for this issue.
pl: Brak dostępnych przejść dla tego zgłoszenia.

# Msg_NoDoneTransition
source: No 'Done' transition found. Available transitions: {0}
pl: Nie znaleziono przejścia 'Zakończone'. Dostępne przejścia: {0}

# Msg_Title_Success
source: Success
pl: Sukces

# Msg_TransitionSuccess
source: Issue {0} successfully transitioned to '{1}'.
pl: Zgłoszenie {0} zostało pomyślnie przejściowane do '{1}'.

# Msg_TransitionFailed
source: Failed to transition issue. Please try again.
pl: Nie udało się przejściować zgłoszenia. Spróbuj ponownie.

# Btn_RestartNow
source: Restart Now
pl: Uruchom ponownie

# Tooltip_OpenInBrowser
source: Open in browser
pl: Otwórz w przeglądarce

# Tooltip_Reset
source: Reset timer
pl: Resetuj timer

# Tooltip_LogWork
source: Post worklog
pl: Wyślij worklog

# Tooltip_Delete
source: Remove from list
pl: Usuń z listy

# Tooltip_AddLocal
source: Add to local list
pl: Dodaj do listy lokalnej

# Tooltip_MarkDone
source: Mark as done
pl: Oznacz jako zakończone
